#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>


//输入描述：
//输入包含三行，
//第一行包含两个正整数n, m，用空格分隔。n表示第二行第一个升序序列中数字的个数，m表示第三行第二个升序序列中数字的个数。
//第二行包含n个整数，用空格分隔。
//第三行包含m个整数，用空格分隔。
//
//输出描述：
//输出为一行，输出长度为n + m的升序序列，即长度为n的升序序列和长度为m的升序序列中的元素重新进行升序序列排列合并。
//
//示例
//输入：
//  5 6
//  1 3 7 9 22
//  2 8 10 17 33 44
//输出：
//  1 2 3 7 8 9 10 17 22 33 44

//int main() {
//    //输入的两个值
//    int n = 0;
//    int m = 0;
//    scanf("%d %d", &n, &m);
//    //创建两个数组存放两组数据
//    int arr1[1000] = { 0 };
//    int arr2[1000] = { 0 };
//    for (int i = 0; i < n; i++)//输入n个值
//    {
//        scanf("%d", &arr1[i]);
//    }
//    for (int j = 0; j < m; j++)//输入m个值
//    {
//        scanf("%d", &arr2[j]);
//    }
//    //创建两个下标
//    int i = 0;
//    int j = 0;
//    while (i < n && j < m)
//    {
//        //谁小就打印谁
//        //谁小就下标往后走
//        if (arr1[i] < arr2[j])
//        {
//            printf("%d ", arr1[i]);
//            i++;
//        }
//        else
//        {
//            printf("%d ", arr2[j]);
//            j++;
//        }
//    }
//    //最后有一组打印完了，剩下的就直接打印
//    //谁打印一个就++，直至打印完所有数据
//    while (i < n)
//    {
//        printf("%d ", arr1[i]);
//        i++;
//    }
//    while (j < m)
//    {
//        printf("%d ", arr2[j]);
//        j++;
//    }
//    return 0;
//}


//【一维数组】输入10个整数，求平均值
//编写一个程序，从用户输入中读取10个整数并存储在一个数组中。然后，计算并输出这些整数的平均值。

//int main()
//{
//	int arr[10] = { 0 };
//	for (int i = 0; i < 10; i++)
//	{
//		scanf("%d", &arr[i]);
//	}
//	int sum = 0;
//	for (int j = 0; j < 10; j++)
//	{
//		sum += arr[j];
//	}
//	double avg = 0;
//	avg = sum / 10.0;
//	printf("%lf\n", avg);
//	return 0;
//}

//求一个很大数的平均值
//int main() 
//{
//    int arr[10];
//    double avg = 0.0;
//
//    for (int i = 0; i < 10; i++) 
//    {
//        scanf("%d", &arr[i]);
//        avg = avg + arr[i] / 10.0; // 每次累加时就除以10
//    }
//
//    printf("Average: %lf\n", avg); // 输出平均值
//    return 0;
//}


//【一维数组】交换数组
//将数组A中的内容和数组B中的内容进行交换。（数组一样大）
//int main()
//{
//	int a[5] = { 1,2,3,4,5 };
//	int b[5] = { 6,7,8,9,10 };
//	for (int i = 0; i < 5; i++)
//	{
//		int c = 0;
//		c = a[i];
//		a[i] = b[i];
//		b[i] = c;
//	}
//	for (int i = 0; i < 5; i++)
//	{
//		printf("%d", a[i]);
//	}
//	printf("\n");
//	for (int i = 0; i < 5; i++)
//	{
//		printf("%d", b[i]);
//	}
//	return 0;
//}