#define _CRT_SECURE_NO_WARNINGS 1

#include <stdio.h>


//int main()
//{
//	//不完全初始化
//	int arr1[3][5] = { 1,2 };
//	int arr2[3][5] = { 0 };
//	//完全初始化
//	int arr3[3][5] = { 1,2,3,4,5, 2,3,4,5,6, 3,4,5,6,7 };
//	//按照行初始化
//	int arr4[3][4] = { {1,2},{3,4},{5,6} };
//	//初始化时省略行，但是不能省略列
//	int arr7[][5] = { {1,2}, {3,4}, {5,6} };
//
//
//	return 0;
//}

//int main()
//{
//	int arr[3][5] = { 1,2,3,4,5, 2,3,4,5,6, 3,4,5,6,7 };
//	printf("%d\n", arr[2][4]);
//	return 0;
//}



//⼆维数组的输⼊和输出
// 
// 
//int main()
//{
//	int arr[3][5] = { 1,2,3,4,5, 2,3,4,5,6, 3,4,5,6,7 };
//	int i = 0;//遍历行
//	//输入
//	for (i = 0; i < 3; i++)//产生行号
//	{
//		int j = 0;
//		for (j = 0; j < 5; j++)//产生列号
//		{
//			scanf("%d", &arr[i][j]);//输入数据
//		}
//	}
//	//输出
//	for (i = 0; i < 3; i++)//产生行号
//	{
//		int j = 0;
//		for (j = 0; j < 5; j++)//产生列号
//		{
//			printf("%d ", arr[i][j]);//输出数据
//		}
//		printf("\n");
//	}
//	return 0;
//}


//⼆维数组在内存中的存储

int main()
{
	int arr[3][5] = { 0 };
	int i = 0;
	int j = 0;
	for (i = 0; i < 3; i++)
	{
		for (j = 0; j < 5; j++)
		{
			printf("&arr[%d][%d] = %p\n", i, j, &arr[i][j]);
		}
	}
	return 0;
}